backend/blog/app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."post_index_number" = ? LIMIT ?  [["post_index_number", 5623386], ["LIMIT", 1]]
INSERT INTO "comments" ("comment_body", "post_id", "comment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment_body", "hello there sailor"], ["post_id", 2], ["comment_id", 361214925], ["created_at", "2017-09-23 20:25:45.868177"], ["updated_at", "2017-09-23 20:25:45.868177"]]
---
  def create
    allparams = comment_params
    puts 'these are all the params: '
    puts allparams
    post = Post.find_by(post_index_number: allparams['post_index_number'])
    puts 'this is the post: '
    puts post
    puts '********************'
    if post==nil
      puts 'inside post nil'
      render json: 'error - post email does not exist '
    else
      @comment = post.comments.create(comment_params)