backend/blog/app/controllers/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "email@email.com"], ["LIMIT", 1]]
INSERT INTO "posts" ("post_title", "post_body", "user_email", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["post_title", "yolo"], ["post_body", "hello there sailor"], ["user_email", "email"], ["user_id", 1], ["created_at", "2017-09-23 18:16:15.516338"], ["updated_at", "2017-09-23 18:16:15.516338"]]
---
  def create
    allparams = post_params
    user = User.find_by(email: allparams['user_email'])
    puts 'this is the user: '
    puts user
    puts '********************'
    if user==nil
      puts 'inside user nil'
      render json: 'error - user email does not exist '
    else
      @post = user.posts.create(post_params)